# QMUL Careers Team Python Script

In [26]:
# The first cell imports some of the software that the programme needs, if you click the small play button above, or press Shift and Enter, it will run the cell.

In [27]:
import pandas as pd
import openpyxl
import numpy as np
import os
import ipywidgets

In [28]:
def get_sheet():
    for file in os.listdir('.'):
        if file.endswith("applications.xlsx"):
            myfile = file
            print(f'{file} has been selected.')
        else:
            pass           
    try:
        return myfile
    except:
        print('No file has been uploaded')
    
grabbit = get_sheet()
try:
    df = pd.read_excel(grabbit, sheet_name='data')
except Exception:
    print("Make sure your excel sheet has a tab called data, delete it and reupload it with the correct tab'")
for i in df.columns:
    df.rename(columns={i:i.lower()}, inplace=True)

criteria = [ 
'student number',
'year of study',
'gender',
'faculty',
'total',
'course',
'personality type',
'mode of attendance',
'bursary holder',
'location']

applications.xlsx has been selected.

In [29]:
for_sorting = ['total']

# to add more items to sort by, you need to add them to this list here.

In [30]:
# Any missing scores will be replaced with the average score of the dataset.

In [31]:
df['total'].fillna(df['total'].mean(), inplace=True)

## Dataset Distributions Pre-Sorting

### Gender Distribution

In [32]:
gen = df['gender'].value_counts().to_frame()
gen['Percentage'] = (gen['gender']/sum(gen['gender']))*100
gen.rename(columns={'gender':'Count'}, inplace = True)
gen

   Count  Percentage
F     42        70.0
M     18        30.0

### Year of Study Distribution

In [33]:
yos = df['year of study'].value_counts().sort_index(ascending=True).to_frame()
yos['Percentage'] = round((yos['year of study']/sum(yos['year of study']))*100, 2)
gen.rename(columns={'year of study':'Count'}, inplace = True)
yos

   year of study  Percentage
1              5        8.33
2             32       53.33
3             20       33.33
4              3        5.00

In [34]:
group_df = df[criteria]

In [35]:
group_df = group_df.assign(groupno='')

In [36]:
# The Sorting Algorithm

In [37]:
def assign_group(df):
    df.sort_values(by=for_sorting, ascending=False, inplace=True)
    count = 1
    up = True
    for i,row in group_df.iterrows():

        if count <= round(len(df)/5,0) and up == True:
            df.at[i,'groupno'] = count
            count += 1

        elif count > round(len(df)/5,0) and up == True:
            df.at[i,'groupno'] = count-1
            count-=1
            up = False

        if count > 1 and up == False:
            df.at[i,'groupno'] = count
            count -= 1
            
        elif count == 1 and up == False:
            df.at[i,'groupno'] = count
            up = True
    
    return df

assigned = assign_group(group_df)

## Group Breakdowns

### Average Scores

In [38]:
highest = assigned.groupby(['groupno'])[['total']].mean().max().round(2)[0]
lowest = assigned.groupby(['groupno'])[['total']].mean().min().round(2)[0]
avg_ser = assigned.groupby(['groupno'])[['total']].mean().round(2)
avg_score = round(avg_ser['total'].mean(),(2))
print(f'Average Score All Groups: {avg_score} \nHighest Average Group Score: {highest} \nLowest Average Group Score: {lowest}')

Average Score All Groups: 7.17
Highest Average Group Score: 7.4
Lowest Average Group Score: 6.9

In [39]:
yos2 = assigned.pivot_table(index=['groupno'], columns=['year of study'], aggfunc='size', fill_value=0)
gen2 = assigned.pivot_table(index=['groupno'], columns=['gender'], aggfunc='size', fill_value=0)
bur = assigned.pivot_table(index=['groupno'], columns=['bursary holder'], aggfunc='size', fill_value=0)
fac = assigned.pivot_table(index=['groupno'], columns=['faculty'], aggfunc='size', fill_value=0)

### Year of Study

In [40]:
display(yos2)

year of study  1  2  3  4
groupno
1              2  2  1  0
2              0  4  1  0
3              0  2  3  0
4              0  4  0  1
5              2  2  1  0
6              1  3  1  0
7              0  0  5  0
8              0  4  1  0
9              0  1  4  0
10             0  5  0  0
11             0  2  2  1
12             0  3  1  1

### Gender

In [41]:
display(gen2)

gender   F  M
groupno
1        4  1
2        3  2
3        3  2
4        2  3
5        4  1
6        4  1
7        3  2
8        2  3
9        5  0
10       5  0
11       3  2
12       4  1

### Bursary Holders

In [42]:
display(bur)

bursary holder  No  Yes
groupno
1                2    3
2                1    4
3                4    1
4                3    2
5                3    2
6                4    1
7                2    3
8                4    1
9                4    1
10               1    4
11               3    2
12               4    1

### Faculty

In [43]:
display(fac)

faculty  Humanities and Social Sciences  Science and Engineering
groupno
1                                     5                        0
2                                     3                        2
3                                     3                        2
4                                     2                        3
5                                     3                        2
6                                     2                        3
7                                     3                        2
8                                     3                        2
9                                     1                        4
10                                    2                        3
11                                    5                        0
12                                    3                        2

### Location

In [44]:
assigned.pivot_table(index=['groupno'], columns=['location'], aggfunc='size', fill_value=0)

location,Africa,Australia,East Asia,Europe,Middle East,North America,South America,South Asia
groupno,,,,,,,,
1,2,1,0,2,0,0,0,0
2,0,0,2,1,0,1,1,0
3,1,0,0,1,0,2,1,0
4,0,2,0,0,1,0,1,1
5,2,1,0,0,1,0,1,0
6,1,0,1,1,0,0,0,2
7,2,1,0,0,0,0,0,2
8,0,1,2,0,1,0,1,0
9,0,0,0,1,0,2,0,2
10,0,1,0,1,3,0,0,0
11,0,1,0,1,2,1,0,0
12,0,0,2,0,0,1,1,1

### Personality Type

In [45]:
assigned.pivot_table(index=['groupno'], columns=['personality type'], aggfunc='size', fill_value=0)

personality type,Adventurer ISFP,Advocate INFJ,Architect INTJ,Campaigner ENFP,Commander ENTJ,Consul ESFJ,Debater ENTP,Defender ISFJ,Entertainer ESFP,Entrepreneur ESTP,Executive ESTJ,Logician INTP,Protagonist ENFJ,Virtuoso ISTP
groupno,,,,,,,,,,,,,,
1,0,1,0,0,0,0,1,0,0,1,0,0,2,0
2,0,0,1,0,1,0,0,0,0,0,0,0,3,0
3,0,0,0,0,1,1,0,0,0,1,0,0,2,0
4,0,1,0,0,1,1,0,0,0,0,0,1,1,0
5,0,1,0,2,0,0,0,1,0,0,1,0,0,0
6,0,1,0,0,0,0,0,0,1,0,0,0,3,0
7,0,2,0,0,0,2,0,0,0,0,0,0,0,1
8,1,1,0,0,0,2,0,0,0,1,0,0,0,0
9,0,1,0,0,0,0,0,1,1,0,0,0,2,0
10,0,1,0,0,0,0,0,0,0,0,0,0,4,0
11,1,0,1,0,0,0,0,0,0,1,0,0,2,0
12,0,1,0,0,1,1,0,0,0,0,0,0,2,0

### Click the download button below for applications assigned to groups

In [46]:
subset = assigned[['student number','groupno']]

final = pd.merge(df,subset, how='inner', on='student number')

In [47]:
final.to_excel("grouped_students.xlsx",sheet_name='Grouped Students')

In [48]:
import urllib.parse
def build_csv_data(dataframe):
    csv_data = dataframe.to_csv(index=False, encoding='utf-8')
    return csv_data

In [49]:
from ipywidgets import Output, Button
from IPython.display import HTML, clear_output
from base64 import b64encode

download_output = Output()
display(download_output)
def trigger_download(filename, kind='text/csv'):
    # see https://developer.mozilla.org/en-US/docs/Web/HTTP/Basics_of_HTTP/Data_URIs for details
    text = build_csv_data(final)
    content_b64 = b64encode(text.encode()).decode()
    data_url = f'data:{kind};charset=utf-8;base64,{content_b64}'
    js_code = f"""
        var a = document.createElement('a');
        a.setAttribute('download', '{filename}');
        a.setAttribute('href', '{data_url}');
        a.click()
    """
    with download_output:
        clear_output()
        display(HTML(f'<script>{js_code}</script>'))

btn = Button(description='Download Groups')
def download_groups(e=None):
    trigger_download('applications_grouped.csv', kind='text/csv')
btn.on_click(download_groups)
display(btn)

Output()

Button(description='Download Groups', style=ButtonStyle())